[
    {
        "word": "Picky bits",
        "mean": "A term used by Brits to describe a meal reserved for (approx 7 annual) hot weather days because it is too hot to cook. Consists of sweet and savoury finger food, along with beer, cider, Capri Sun and wasps.",
        "example": "Child: \"What's for tea?\"\nMum: \"Picky bits\""
    },
    {
        "word": "Lawfare",
        "mean": "The use of legal system to overwhelm an opponent, such as to stop or destroy them.",
        "example": "All's fair in love and war, but in lawfare, the person with the most money or best legal team, can make justice seem unfair."
    },
    {
        "word": "aggrorithm",
        "mean": "Aggrorithm (n): an algorithm written to incite aggression.Aggrorithms are a dark pattern employed by businesses with bottom lines tied to confrontation and conflict (“engagement”).\nProfiling data is used to nudge users into conflict and increase revenue.",
        "example": "The Youtube Aggrorithm has been recommending Red-Pill Incel videos to my 13 year old son again."
    },
    {
        "word": "spectacles, testicles, wallet and watch",
        "mean": "An easy way to remember \"The Sign of the Cross\" in Christianity, more specifically, Catholicism.",
        "example": "John couldn't remember which order to sign his cross, and Tim said, \"Heck man, that's easy. Go like this, spectacles, testicles, wallet and watch.\" He then demonstrated."
    },
    {
        "word": "Genny Neutch",
        "mean": "A general name for a gender neutral person",
        "example": "I forgot Genny Neutch's name. I'll ask them later"
    },
    {
        "word": "Premature Articulation",
        "mean": "When someone interrupts you while you are talking but what they have to say has nothing to do with what you were talking about. Someone who talks out of turn.",
        "example": "ME: My boss fired me the other day because I kept interrupting him when he was trying to tell me what to do.YOU: Sounds like you suffer from Premature Articulation."
    },
    {
        "word": "Ceiling Titty",
        "mean": "A lighting fixture on ones ceiling that resembles a women's breast.",
        "example": "Bro, your ceiling titty is turning me on."
    },
    {
        "word": "bang over",
        "mean": "When you wake up with a sore neck from too much headbanging at the metal show the night before.",
        "example": "I went to the Slayer show last night and I woke up with a serious bang over after headbanging through the whole set.  It was so brutal!  SLAYER!!! \\m/"
    },
    {
        "word": "jump the couch",
        "mean": "A defining moment when you know someone has gone off the deep end. Inspired by Tom Cruise's recent behavior on Oprah. Also see jump the shark",
        "example": "My new boyfriend Benny seemed totally normal until he jumped the couch and started rubbing spicy brown mustard on his body at my family reunion."
    },
    {
        "word": "vitamin sea",
        "mean": "To spend time in the ocean to lift one's mood and/or health. (Possibly to surf or play in the water.)",
        "example": "Bro, you're in a bad way; go get some vitamin sea."
    },
    {
        "word": "Dining Dead",
        "mean": "A couple that eats at restaurants in total silence, very awkward, very sad.",
        "example": "\"Are we going to be that kind of couple, that eat our food silently...the dining dead?\" He thought."
    },
    {
        "word": "potato shed",
        "mean": "During the covid-19 pandemic, cruising houses on Zillow while stuck at home became a national pastime. Enter, Zillow Gone Wild. This Instagram account rocketed to popularity in 2020 for its snarky yet accurate descriptions of unusual real estate listings. A particularly opulent Dover, MA listing included, among other excesses, a fully stocked potato shed. It sold in 2021 for an eye-popping $13,250,000. Subsequent Zillow Gone Wild posts frequently reference \"no potato shed\" in their intros, meaning that it's great but there's still room for extra bling.",
        "example": "On today’s episode of You Never Know What’s Going On Inside A Home, Part 39.🚨🚨🚨Listing outlink\n$1,450,000\nNew Berlin, WI\n6 bd, 7 ba\n6,254 sq ft\n17.49 acres\nPlenty of room for a potato shed."
    },
    {
        "word": "Brain Rave",
        "mean": "A term used to describe insomnia caused by persistent thoughts, such as old memories or unsettling experiences, which disrupts the ability to sleep.",
        "example": "Last night I had an extreme Brain RaveSame, insomnia is pretty annoying..."
    },
    {
        "word": "peachmeat",
        "mean": "The extra firm and tangy or super soft and sweet fleshy meat of peaches.",
        "example": "Nothing is more satisfying than peachmeat in the summertime."
    },
    {
        "word": "alligator pear",
        "mean": "An avocado is called an alligator pear by some New Orleanians.",
        "example": "You can't make guacamole without an alligator pear."
    },
    {
        "word": "eleven pound whole slab of deli ham",
        "mean": "11 pound slab of ham is a processed meat cube of ham mostly used in recreationel purposes",
        "example": "karen: is that ham processed, if it is i dont want itmeat bearer: Ma'am that is an eleven pound whole slab of deli ham. it has no bones, fat, or connective tissue. it is an amalgamation of the meat of several pigs , emulsified, liquefied, strained, and ultimately inexorably joined in an unholy meat obelisk. god has no hand in the creation of this abhorrence. the fact that this ham monolith exists proves that god is either impotent to alter his universe or ignorant to the horrors taking place in his kingdom. This prism of pork is more than deli meat. it is a physical declaration of makind's contempt for the natural order. it is hubris manifest. we also have a lower sodium variety if you would prefer that"
    },
    {
        "word": "glo day",
        "mean": "Originated in Chicago, this word/phrase means birthday.",
        "example": "1. Hey Roman, today's your glo day right?\n2. My glo day is tomorrow!"
    },
    {
        "word": "godfather syndrome",
        "mean": "Occurs in movie franchises when a third installment of a movie franchise is widely considered disappointing compared to the previous two. \n\nBased on The Godfather Part III, which is commonly considered inferior to Part I and II.",
        "example": "Seen Spiderman 3? Worst case of Godfather Syndrome I've seen in years. "
    },
    {
        "word": "nature's pocket",
        "mean": "Known as many things but most commonly refered to as the butt.",
        "example": "Just remember Tyler, if you get cold put your hands in Nature's pocket."
    },
    {
        "word": "Struggle Dress",
        "mean": "An old cheap sundress that is used to wear around the house for cleaning/housework.",
        "example": "I don’t have anymore clean clothes so I had to go do laundry in my struggle dress."
    },
    {
        "word": "Dungeon Tan",
        "mean": "Originally used to describe the pallor which developed amongst inveterate D&D players, it widened to include denizens of any stripe who resided in the basement of their parents. Most recently it is used to describe the complexion of any video game addict.",
        "example": "1978: His dungeon tan is proof enough that he is an indestructible wizard.\n1998: \"Yo, ghost boy ! Nice dungeon tan. I see that you gave up POGs for Magic Cards !\"\n2008: PlayStation and Xbox gave him the dungeon tan. But at least Wii gives him some muscle tone."
    },
    {
        "word": "reefer sadness",
        "mean": "Despondency related to a lack of marijuana.\n\nA play on the phrase \"reefer madness,\" which is originally a 1936 anti-marijuana propaganda film. ",
        "example": "Man, last week my mom smoked all my shit, and I'm broke.  I had a bad case of reefer sadness."
    },
    {
        "word": "shrimpy",
        "mean": "A little ass dick",
        "example": "\"Yo if one of my ex's who had a shrimpy ,they better be careful and don't test me. I will expose you!!!😐🤗"
    },
    {
        "word": "glossy taco",
        "mean": "Slang used in the nail art world meaning \"glossy top coat\", because of the similarity in the pronunciation of the two phrases. The phrase was coined and made popular by famous nail 'artist' Cristine Rotenberg (Simply Nailogical) after she created, climbed and conquered Polish Mountain.",
        "example": "Add a nice thick coat of glossy taco then let that dry because we're gonna add nail vinyls next!"
    },
    {
        "word": "Mashed potatoes",
        "mean": "The act of sexual intercourse when both parties are heavily intoxicated and just end up mashing their genitals together.",
        "example": "Dude, bro, I had Amber over last night after the bars but we were so wasted that we just wound up having mashed potatoes until we passed out"
    },
    {
        "word": "Handle with care",
        "mean": "Just like \"Fragile\" or \"This side up\", this labeling will almost 100% guarantee that your parcel will be tossed, bounced, drop-kicked, and/or stomped upon by disgruntled/delinquent shipping-personnel during its entire journey from you to your intended recipient. Yep, I'm talking to YOU, USPS/UPS/FedEx!!! There --- I said it --- got it off my chest! :P",
        "example": "During the infamous \"angry political activists shooting at passing semi-trucks\" period back in the 80's, some truckers apparently resorted to painting their trailers with huge \"Caution: explosives\"-type signs to discourage nearby riflemen who would prefer not to get blown up themselves along with their intended targets. A cartoon in a magazine during that time showed two redneck 18-wheeler-drivers discussing a huge \"WHAMMO DYNAMITE\" label that the speaker has painted on the side of his van; the driver is saying something like, \"Actually, I'm hauling dried prunes, but I feel a lot safer this way, rather than my having 'Handle with care' written on there instead.\""
    },
    {
        "word": "Pretendance",
        "mean": "Signing into an online meeting in order to appear in attendance and engaged, when in fact you are doing other things.",
        "example": "Rick had perfect pretendance at the weekly sales meetings this month."
    },
    {
        "word": "Jungalow",
        "mean": " A synonym for treehouse; derived from \"jungle\" and \"bungalow\".",
        "example": " Do you live in an apartment. No, I live in a jungalow."
    },
    {
        "word": "brown acid",
        "mean": "1. A reference to the Woodstock Festival in 1969, when stage announcements were made by legendary radio disc jockey Wavy Gravy, telling people that some of the brown-colored blotter acid (LSD) circulating the crowd was giving people negative hallucinations, causing freakouts.\n2. A bad drug experience\n3. Something that was supposed to be pleasurable but turned out nightmarish.",
        "example": "1. I thought this job was going to be fun, but it turned out to be, like, \"Dude, don't take the brown acid.\"\n2. That chick is the brown acid, but hey, it's up to you."
    },
    {
        "word": "polycrisis",
        "mean": "1. First coined in the 1970s, the word has been popularized by the historian Adam Tooze to describe the coming together of multiple crises.2. A polyamorous relationship 90% of the time",
        "example": "The president choked on a peanut and died, I can't pay my bills and my gf and my other gf broke up with me...bruh this is a polycrisis"
    },
    {
        "word": "Disstrumental",
        "mean": "An instrumental track created with the intent to diss or insult an opposition or rival.The term gained popularity from Metro Boomin's instrumental \"BBL Drizzy,\" which was crafted as a diss towards artist Drake. This was in response to Drake's diss track \"Push Ups,\" where Drake provocatively stated, \"Metro shut yo hoe ass up and play some drums.\" Metro Boomin's disstrumental exemplifies the use of a purely instrumental piece to convey animosity or criticism without the need for lyrics.",
        "example": "\"The producer dropped a new disstrumental aimed at his industry rival, setting the stage for a heated musical feud.\""
    },
    {
        "word": "except for Jeff",
        "mean": "When a straight guy is sexually attracted to and/or banged another guy. But only ONE guyCan't say no to Jeff",
        "example": "for all intents and purposes he is straight except for Jeff."
    },
    {
        "word": "loretuber",
        "mean": "A YouTube channel or vlogger devoted to parsing lore, usually from a specific IP or IPs. Greatly depended upon by certain niche gaming communities.",
        "example": "VaatiVidya is such a great loretuber. How else would I ever know who Messmer's parents are? Or why Gael needed to find the Blood of the Dark Soul?"
    },
    {
        "word": "baby dust",
        "mean": "wishing baby dust on a woman or couple is a way of wishing them luck on concieving.",
        "example": "Good luck and lots of baby dust to you, I hope it works out"
    },
    {
        "word": "PMDA",
        "mean": "Stands for \"pardon my dumb ass\". Often used when you have to ask a question you feel you should know.",
        "example": "What's the Iran-Contra Affair? PMDA"
    },
    {
        "word": "showmance",
        "mean": "When actors engage in a romance for the run of a show.\nOnce the run is over so is the romance.\nThe term originated in the theater and moved to movies and scripted television and then reality television.\nThe term has now moved to the populace to discribe any contrived romance.",
        "example": "Dude 1: I didn't know Anthony and Cicely were dating.\nDude 2: It's just a showmance, Cicely is just dating Anthony just to make Edgar jealous.\n\nDude 1: I didn't know Anthony and Cicely were dating.\nDude 2: They're not. It's just a showmance, Anthony is gay."
    },
    {
        "word": "Dommy Mommy",
        "mean": "A gentle dominant woman. A woman who will just hold you until kingdom come. A woman that will spoon you when you're cold and kiss your neck to make you shiver. A woman that will love you for who you are while staying having that wonderful quality of dominance that subby males crave. A woman that will let you use her tits as a pillow. A woman that will wrap you in your thighs or sit in your face and make you feel loved and wanted. A perfect woman.",
        "example": "Man I wish a had a dommy mommy to be spooned by rn."
    },
    {
        "word": "Scanlation",
        "mean": "Scanlations are unofficial translations of comics, posed on the Internet. The name is derived from the process, as, usually, a scanlation is done through scanning a hard copy of the original, whiting out the speech bubbles, and typing the translation in its place. Scanlations can range from basic unjustified text copy-pasted from Google Translate to professional-quality localizations, though it is noted that scanlations are often more faithful to the original than official localizations. From the same source as \"scanlation\", the verb \"scanlate\" is also in use.On top of its illegality, scanlation has a bad reputation due to a massive amount of scanlated material being erotic manga. However, it is a misconception that only such works are scanlated, or even only mangas at all; for instance, Franco-Belgian comics such as \"Spirou et Fantasio\" that never received English versions have been scanlated thusly.Unauthorized translations of already freely available webcomics are sometimes lumped together with scanlations, although, since no scanning is involved, they may not actually qualify depending on who you ask.",
        "example": "The official translation was cancelled, we're lucky to have scanlations."
    },
    {
        "word": "fake deep",
        "mean": "'fake deep' is a description equivalent to an overt chauvinistic person. They appear 'smart,' 'educated,' or 'woke' upon first impression but the underlying meanings of their words contradict intent.",
        "example": "\"I'm tired of these fake deep people trying to tell people how to live their lives and thinking they have all the answers.\"\n\"I hate those fake deep men complimenting / praising women while subliminally laying out rules by which they should look, feel, and act.\"\n\"Fake deeps shift stereotypes and simultaneously dehumanize marginalized groups.\""
    },
    {
        "word": "Toxicus",
        "mean": "The latin translation of \"toxic'",
        "example": "Teacher: \"I know its Friday but, I'm still going to be assigning an essay due next Monday\"\nMe: \"Woah magister that's so toxicus\""
    },
    {
        "word": "Shaggy Defense",
        "mean": "When someone is caught committing a crime (mainly one sexual in nature, but can refer to all crimes), with overwhelming evidence to prove they did it; in their defense, the culprit denies that they were the one caught doing the crime.Derived from the Shaggy song \"It Wasn't Me\", which describes a man being caught having sex with another woman by his wife, and subsequently denying that it was him she actually saw.",
        "example": "When caught on video having sex with a 14 year old girl, R. Kelly employed the Shaggy Defense; he just denied that he was the one in the video."
    },
    {
        "word": "solo dolo",
        "mean": "1) to do things by yourself ( solo) and on the down low (dolo)\n2) A loner",
        "example": "\"I'm on my solo dolo shit, just keeepin to myself\""
    },
    {
        "word": "calendar wolf",
        "mean": "A wolf that has been hand-raised for the sole reason of photographed for calendars. Usually, calendar wolves look much healthier than their wild cousins, and eat not from freshly killed prey, but a bowl with their name on it. Could also refer to a disingenuous person, or a poseur.",
        "example": "The wolf looks so healthy in that photo because he's a calendar wolf."
    },
    {
        "word": "Snubgrub",
        "mean": "“Snubgrub (noun): A term used to describe the specific feeling or situation in which an individual experiences hunger or the desire to eat, yet simultaneously expresses a strong aversion or reluctance to consume any of the available food items within their immediate environment, particularly in one’s kitchen.",
        "example": "“After rummaging through the fridge for the third time, Jenna realized she was in a snubgrub mood; despite her hunger, nothing seemed appealing enough to eat.”"
    },
    {
        "word": "cessy",
        "mean": "Drunk, wasted, hammered, shitfaced. Short for cesspool.",
        "example": "After only two glasses of wine Lisa was totally cessy!"
    },
    {
        "word": "somethingburger",
        "mean": "A term used when the person speaking or writing is partially true, coherent or fulfilling in some way. May also be used for when it’s mostly or partially false and/or incoherent.",
        "example": "Person 1: Have you seen the news?\nPerson 2: Yeah it was a somethingburger."
    },
    {
        "word": "Boonscrolling",
        "mean": "The opposite of doomscrolling, where one refreshes or advances through social media feeds looking for relatable, positive, and uplifting content, often with the effect of forging connections where they didn't previously exist.",
        "example": "User1: \"I was doomscrolling Facebook last night and founds someone else who genuinely loves 'Plan 9 From Outer Space'. We ended up going back and forth about it for an hour.\"\nUser2: \"Sounds like you were boonscrolling.\""
    },
    {
        "word": "totty",
        "mean": "Totty is British slang for sexy women, also rhymes with hottie",
        "example": "Do a google image search for totty and see for yourself."
    },
    {
        "word": "flake watch",
        "mean": "When you're closely observing someone who you believe might flake on you, you have them on flake watch.",
        "example": "I made plans with Liz last night but I feel she may bail out. I've got her on flake watch"
    },
    {
        "word": "Tamagotchi effect",
        "mean": "The term one uses when a person develops a strong emotional attachment towards a machine or a robot.",
        "example": "Jimmy was so upset when his furby died, he obviously was suffering from the tamagotchi effect."
    },
    {
        "word": "iPhone face",
        "mean": "The face of an actor who is playing a character in a period piece but has a modern looking face– like they would know what an iPhone is.",
        "example": "Omg the cast of Daisy Jones and the Six all have iPhone faces."
    },
    {
        "word": "blunch",
        "mean": "First meal of day eaten at lunchtime. As opposed to brunch which is eaten at 10 or 11, blunch is eaten at 12 or 1.",
        "example": "I wasn't hungry in the morning so I had blunch."
    },
    {
        "word": "gold bricked house",
        "mean": "A medium to large sized house, that is well kept yet vacant - having been bought by banks, house flippers or speculators for the sole sake of investment, like a gold brick, rather than being used to live in. One of the major reasons for the high prices of housing, and also the shortage of 𝘢𝘧𝘧𝘰𝘳𝘥𝘢𝘣𝘭𝘦 housing.",
        "example": "Drove through this nice neighborhood, but noticed a lot of empty homes with no \"for sale\" signs. But later I found all those houses are half a million each, even though they aren't that big. Seem those empty homes are gold bricked houses."
    },
    {
        "word": "Almond mom",
        "mean": "A mom who is stuck in dieting culture. The mom who projects their fears of fat phobia onto their own kids. The mom who thinks she is doing good for their kids but is really causing trauma. The term originates from “The Real Housewives of Beverly Hills”.",
        "example": "“I hated my almond mom. She would always make comments about my weight”"
    },
    {
        "word": "Zebra",
        "mean": "An obscure illness, disease or condition affecting a comparatively small number of people, but with symptoms somewhat similar to one or more different and more common illnesses.It is named because these diseases/conditions are sometimes misdiagnosed by well meaning (but often inexperienced) doctors when something far more common is actually the cause. Medical students are told \"remember, if you hear hoof beats, think horses, not zebras\".",
        "example": "Doctor 1 - \"I think this patient may have Castleman's disease\"\nDoctor 2 - \"Castleman's disease is a zebra, there are far more likely causes of his fever and weight loss.\""
    },
    {
        "word": "No Shot",
        "mean": "When there is absolutely no chance that something happened/or is true. The phrase first gained popularity when it was heard echoing from a shipping container somewhere in Austin, Texas. It can even be traced back to an individual named Tyler \"Dimmadomefuck\" Niknam, from whom it spread like a virus.It is typical for people who have adapted this phrase to use it continuously to the point where it becomes frustrating. Saying \"No shot\" ad nauseam has been linked with heavy cocaine use and having sudden bald spots appear.",
        "example": "\"I did not commit the murder, i swear!\"\n\"No shot, bucko! Vote him out.\"\"There should be equal treatment of men and women in this workplace.\"\n\" NOOO Shot!\""
    },
    {
        "word": "Yogurt Male",
        "mean": "A more sophisticated and superior male to alpha/sigma males. Yogurt males are very content and respectful individuals who enjoy yogurt and the simpler things in life, such as long walks on the beach ,or enjoying a beautiful sunset while confidently eating yogurt.",
        "example": "Billy: Is that guy over there an alpha?\nNathan: No, he's a Yogurt male.\nBilly: wow I'm so jealous, I wish I could radiate such confidence and dominance while eating yogurt."
    },
    {
        "word": "Scandal Broth",
        "mean": "From the 1811 Dictionary of the Vulgar Tongue. Also called 'Cat Lap' or 'Chatter Broth,' it refers simply to tea, one of the greatest beverages ever. Named for the amount of conversation and gossip often shared while having tea during the Georgian/Regency & Victorian eras. At the time, it was intended to refer to gossip shared by women in particular (but let's be honest. It definitely wasn't just women sipping tea & spilling secrets behind closed parlor doors).1811 Dictionary of the Vulgar Tongue, by Francis Grose\nAdditional information from InfoPlease and the Dictionary of Phrase and Fable, E. Cobham Brewer, 1894",
        "example": "\"(dramatic gasp) No he did not! Hold everything, I'll put the kettle on and make us some scandal broth!\""
    },
    {
        "word": "Inbox Angel",
        "mean": "Girl who sends nudes to lonely Internet weebos.",
        "example": "That girl made my night. What an inbox angel !"
    },
    {
        "word": "floordrobe",
        "mean": "A form of storage for clothing which requires no hangers, drawers, doors or effort. Simply drop on the floor and you have a floordrobe.",
        "example": "We have a very stylish colonial-style his and hers walk-on floordrobe at home."
    },
    {
        "word": "(◕‿◕✿)",
        "mean": "(Adj) When something or someone is acting, being, or talking really adorable",
        "example": "Girl 1: Then he told me I had the stars in my eyesGirl 2: Aww (◕‿◕✿)"
    },
    {
        "word": "felony ring",
        "mean": "  the residue that forms around your nostril shortly after snorting illegal substances.ie; methamphetamine, cocaine, etc.",
        "example": " Before talking to anyone of authority check your nose for a felony ring."
    },
    {
        "word": "scratcher",
        "mean": "An untalented tattoo artist. A tattoo artist who scratches up your skin rather than applying a clean smooth looking tattoo.",
        "example": "Mannn those cats at body tattoo are scratchers."
    },
    {
        "word": "Askhole",
        "mean": "A person who constantly ask for your advice, yet always does the opposite of what you told them!",
        "example": "Me: What do you recommend for dinner here?Friend: The pasta is good.Me to Waiter: I'll have the steak please!Friend: You're such an askhole!"
    },
    {
        "word": "Whaling",
        "mean": "To 'whale' in a game or 'whaling' is a term for gamers or gambling addicts who spend a good huge amount of money on video games or casinos. Since a whale is huge and they pay hugely for gambling or gaming, you can see why this is a thing.With gamers, microtransactions existed for them within free-to play games (e.g. loot boxes, in-game currency, booster packs, cosmetics, etc.), gacha-like games, mobile games, battle-royale games or anything along those lines.Gamblers are people who whale tons of cash on slot machines, poker and other natures of casino games and gambling.\"Whales\" was a phrase first used by video game publishers to describe their main customers who insufferably liked to gamble their money for in-game items.",
        "example": "Bob: \"Hey, Dylan. Guess what happened: I convinced my mum to buy me V-bucks and I spent a heck load on Fartnite last night. So cool, dude.\"Dylan: \"That game is for toddlers. I see why you needed her to buy it for you. Because toddlers rely on their mummies, and you like to whale money within a crappy game, to buy things you don't need. Player Ultimate Battlegrounds is way better than your game.\"Sarah: \"Guys, guys, guys... come on. It's not that bad. I spend my free time whaling my student funds on Weeb/Grand Order to get the best units with Gacha hatchers and to be a better player, haha... I think I'm the worst than both of you combined.\""
    },
    {
        "word": "Money Pull Up",
        "mean": "“Money pull up” is a practice started in Jamaica which involves the shelling out of money to a dj by party goers for him to replay a particular dancehall or reggae song.",
        "example": "“ Only in Jamaica do you see a money pull up at karaoke”"
    },
    {
        "word": "Mascot Horror",
        "mean": "A subgenre of horror that's often made to attract younger audiences, characterized by a recognizable (usually marketable) mascot. Games in this genre may rely on cheap jump scares and are likely to have extremely convoluted lore.Examples of mascot horror include but are not limited to: Five Nights At Freddy's, Poppy Playtime, and Hello Neighbor.",
        "example": "\"bro that new mascot horror game was terrible, the characters are funny though.\""
    },
    {
        "word": "skirted egg",
        "mean": "A person who is bald on top but has hair on the sides and back.  Was heard on Trailer Park Boys, where J-Roc told Mr. Lahey he looked like a \"skirted egg.\"",
        "example": "That guy looks like a skirted egg!"
    },
    {
        "word": "Cumposer",
        "mean": "A person who fakes orgasms.",
        "example": "Jean totally fakes her orgasms, she's a cumposer."
    },
    {
        "word": "Sautéed",
        "mean": "When your friend is high, but instead of being funny, he starts acting pretentious about the weed. This includes a history lesson on the strain or a breakdown on the cannabinoids.",
        "example": "Person 1: “Bro John is soooo fried, he’s talking about tasting the terps and shit”\nPerson 2: “Nah jit aint fried, he’s sautéed”"
    },
    {
        "word": "Piggy Whipped",
        "mean": "To be followed and/or pulled-over by the police.",
        "example": "While speeding inattentively, I noticed flashing lights in my rearview, only to realize I had just been piggy whipped."
    },
    {
        "word": "tofu dreg",
        "mean": "Chinese slang for cheap, shoddy, unsafe, or otherwise inadequate construction. Tofu dreg projects are relatively common in China due to poor building materials, corrupt government inspectors, overly ambitious building schedules, and a lack of care from builders. Features of tofu dreg projects include leaking pipes in new buildings, to no water at all in fire suppression systems, sinkholes, partial to total collapse of buildings. In some cases, concrete and masonry can be destroyed with bare hands, steel rebar can be broken with a few taps on a hard surface.",
        "example": "Many buildings collapsed during the 2008 Sichuan Earthquake that wouldn't have otherwise, had they not been Tofu Dreg constrution."
    },
    {
        "word": "sistren",
        "mean": "girls or women who are not real sisters but who are considered as such; girls or women who share sisterly relations with one another.",
        "example": "All the sistren of the community have been called to a meeting on the village common."
    },
    {
        "word": "poo haiku",
        "mean": "Poems, messages, etc. written in rest room stalls",
        "example": "Here I sit broken hearted,\nSat right down and only farted.\n\nThis is a tee-pee\nFor you to pee-pee.\nNot a wig-wam \nTo beat your tom-tom.\n\nMan's life ambition must be small\nTo write a message on a shithouse wall.\n\nSome of the poo haiku masterpieces of Thomas Crapper...or George Michael..."
    },
    {
        "word": "hateration",
        "mean": "the action of hating",
        "example": "i sense some serious hateration"
    },
    {
        "word": "Vox pop",
        "mean": "Short for Vox Populi, the Latin term for \"voice of the people\" often used to describe an interview with a person who is not an expert, and who is not directly involved with the issue at hand. Also called a \"Man on the street\" interview.",
        "example": "Guy1: Did you see that Vox pop interview on the news last night?\nGuy2: Yeah, that dude was an asshole, he can choke on his own vomit for all I care.\n"
    },
    {
        "word": "green out",
        "mean": "A green out is a cannabis induced physiological or psychological panic attack. Symptoms include sweating, nausea, heart palpitations, hypervigilance, paranoia, and the fear or feeling that you might be dying or about to die. A green out is typically caused by smoking or ingesting too much cannabis too quickly.Green outs are generally brief experiences and may be followed by exhaustion or drowsiness, or a rapid sobering.Unlike black outs, memory loss doesn't tend to occur during a green out due to the intensity of a green out.Memory loss is much more likely to occur during a long, sustained session of cannabis use.Unlike alcohol, cannabis use affects short term memory (what was I saying?) and not long term memory (what did I do last night?).Sativa strains may be more likely to cause green outs (while indicas are more likely to leave you stoned)",
        "example": "Person 1: Dude, don't smoke so much. you'll green out.\nPerson 2: pshh, green out, sure, whatever.\n(green outs vary depending on the circumstances so it's difficult to describe a specific example, and it can take multiple green outs to really understand what's happening when you have one).\nPerson 2, now an experienced pothead: Dude, don't smoke so much. you'll green out.\nPerson 3: pshh, green out, sure, whatever."
    },
    {
        "word": "snag",
        "mean": "a native slag for a person you link up with from a powwow, and do sexual stuff, BUT YOU LEAVE THEM AFTER & IGNORE THEM!! So it’s basically a NATIVE one night stand",
        "example": "•damn she snagged all them boys\n•might snag tonight how about you\n•she looked real snaggable tonight at the powwow"
    },
    {
        "word": "drop trou",
        "mean": "To lower one's pants down to one's ankles, often in a sudden, impulsive manner, thus exposing one's nether regions.",
        "example": "We all dropped trou and mooned the old lady."
    },
    {
        "word": "Haunter",
        "mean": "A haunter is a person who enjoys working in the haunted attractions industry. Most haunters usually enjoy scare acting or working behind the scenes at a haunted attraction. Many haunters come from all sorts of backgrounds but all haunters enjoy the art of scaring willing patrons. There is a whole diverse community based around haunting with some examples being the extreme, immersive, and theme park haunt communities. Haunters have a haunt family, their closest group of friends they share experiences with. Many haunters also have a haunt name, a nickname given by other haunters that you’re stuck with your entire haunting career.",
        "example": "Knott’s Scary Farm is home to many iconic haunters that get paid to scare millions of guests every year."
    },
    {
        "word": "happy happy joy joy",
        "mean": "From the hilarious tv cartoon Ren & Stimpy, happy happy joy joy is defined as when the world expects you to put on this happy and joyful face when what you really want to do is shriek at the top of your lungs and rip your hair out in anger/frustration/misery.  To make everyone happy though, you put on this mask of happy happy joy joy while singing a silly song.",
        "example": "Just as you were ready to leave work for the day, the boss tells you he wants you to work both Saturday and Sunday on the new project.  You're on salary and so will get no more $$ for sacrificing your weekend.  However, the boss is considering you for that vacant position where you'd have your own office with a window, so you happy happy joy joy and say, \"Sure thing, boss!\" with a big toothy grin on your face."
    },
    {
        "word": "Monkey Branching",
        "mean": "Getting your next relationship set up before dumping your current S/O. Generally involves cheating (at least emotionally) on your current partner with the intended future partner. Refers to playing on the monkeybars, where you don't let go of the first bar until you've grabbed on the second.",
        "example": "Bill: \"Well, your brother just sent the Save The Dates for his third marriage - they haven't even finalized the divorce yet!\"Joe: \"Yeah, the monkey branching SOB did the same for his second marriage as well - all his relationships 'overlap,' if ya know what I mean.\"ORJoe: \"Sue and I decided to try an open relationship.\"Bill: \"I dunno, sounds like she's monkey branching to her *next* relationship.\""
    },
    {
        "word": "Pity Pizza",
        "mean": "A meal served by employers to employees, as a way to \"compensate\" them for being underpaid, overworked, and for lack of raises/bonuses and/or meal breaks. Its commonly served during long, hectic working hours when the employer makes it clear that there is not enough staff/time to take a break to eat said pizza, and is usually consumed by other staff who historically under perform and take several long breaks throughout the day that are not warranted. The employees that are dying of hunger and thirst are allowed to smell the Pity Pizza, but rarely are given time to consume it; however they are expected to be grateful for the grand gesture of Pity Pizza",
        "example": "Emily: \"Hey Susan! I've walked 4 miles in this office today running around, l haven't been able to pee or refill my water bottle and I've been here since 4am... don't you think we deserve a raise?\"Susan: \"No Emily, our boss bought us Pity Pizza again instead of providing us with well deserved raises and bonuses....but we don't really have time to actually stop and eat it\""
    },
    {
        "word": "rocker foo",
        "mean": "a cholo who also listens to rocker music.",
        "example": "aye you a rocker foo huh?"
    },
    {
        "word": "brass monkey",
        "mean": "a 40 of Olde English 800 mixed with some OJ. \n\nTypically one drinks the 40 down until the beer is level with the top of the cylinder of the bottle, then fill the bottle back up to the top with orange juice.  \n\nIt is a very tasty treat.\n\nOtherwise known as the \"poor man's mimosa.\"",
        "example": "You wanna hit this Cognac man? \n\nNah...  Poor Man's Mimosas until the day I die..."
    },
    {
        "word": "medieval diss track",
        "mean": "my mill grinds, pepper and spice\nYou’re mill grinds, rats and mice\nMy hand picks, only what growsYour hand picks, only your nose\nMy grain tastes, delightful\nYour grain tastes, very frightful\nMy mother cooks, with much care,\nYour mother cooks, with her hair\nMy wife smells, of pure honey\nYour wife smells, of bad money\nMy fields are, happy to see\nYour fields are, sad to decree\nMy hat fits, like a fiddle\nYour hat fits, like it’s little\nMy king is, smart and wise\nYour king is, full of lies\nMy sheep will, keep us alive\nYour sheep will, fail to arrive",
        "example": "medieval diss track is fire"
    },
    {
        "word": "Eye Dentist",
        "mean": "A spiteful name for ophthalmologists used by real doctors who are bitter that they work more hours.",
        "example": "Oh, so you're not a \"real doctor,\" you're an eye dentist"
    },
    {
        "word": "al chile",
        "mean": "The Mexican \"for real'' expression in Spanish Language. It can be used to ask or confirm.",
        "example": "White boy: Hey Homie, let's try that new thing called the \"gravity bong\"Homie: Al chile?White boy: Al chile!"
    },
    {
        "word": "Scamwich",
        "mean": "The descriptor of the situation where;- An individual purchased a luxurious looking 'filling packed' sandwich.- Said sandwich is then unwrapped or de-bagged for consumption.- The consumer is them revealed to how the sandwich is actually structured; fillings all packed up onto the 'show-side' with little to no filling in the back, resulting in a scamwich.",
        "example": "Aww shit man, I went to this bomb-ass bakery and saw this fuckin' sweet lookin' sandwich in the cabinet. Opened that shit once I got back to work - bitch behind the counter sold me a scamwich."
    },
    {
        "word": "millennial gray",
        "mean": "The sad depressive hue of the color gray which many millennials coat their life in. The color reflects how Millennials went from non-sense happiness, looking at cartoon network and Nickelodeon in the 90's to Inflation and depression in the early 2020's.",
        "example": "Dude, you really painted your room that your are renting with five other people to Millennial Gray? It really shows how old you are."
    },
    {
        "word": "youngshit",
        "mean": "a transgender person who started transitioning as a teen, before the age of 20, which sometimes gives them immense advantages for passing. the opposite of \"oldshit\". both are common terms on the /lgbt/ board of 4chan",
        "example": "those fucking youngshits are lucky they could get HRT so early, meanwhile I'm a fucking oldshit hon coping (and seething) with hair loss and stuck in eternal boymode"
    },
    {
        "word": "mamooshee",
        "mean": "something so cute that you can eat it (farsi).",
        "example": "Wow, your cat is a mamooshee!OMG! you are so cute your a mamooshee!"
    },
    {
        "word": "Dickstinger",
        "mean": "A common strategy in the southeastern United States, where a native wasp is captured and released inside somebody's dwelling at a predetermined time to force them awake.Most commonly a paper wasp or mud dauber, but occasionally a much more aggressive yellowjacket. The wasp will harass any sleeping guests ultimately preventing returning to sleep.",
        "example": "\"Roy thinks he's going to sleep off that hangover, but I've got a dickstinger in a mason jar with his name on it.\"\"If they don't get up before 10AM, I'm releasing a few dickstingers in their room.\""
    },
    {
        "word": "Pien",
        "mean": "The Japanese word for the pleading/puppy eyes expression, more often used for the emoji version of the expression. The word is popularized by the Vtuber streaming scene.",
        "example": "I still can't finish Getting Over It pien"
    },
    {
        "word": "dump his ass",
        "mean": "do it",
        "example": "dump his ass"
    },
    {
        "word": "Alternative Lifestyle Haircut",
        "mean": "alternative lifestyle haircut (n) – A haircut or style that indicates its owner leads a life contrary to that of the conservative or heterosexual world. Also known as “the significant lesbian haircut,” the acquiring of an alternative lifestyle haircut is often seen as a rite of passage into lesbian adulthood, even if it is not maintained after the initial cut. Like a bat mitzvah, but on your head. Examples include: the mohawk, the fauxhawk, the mullet, the sidesweep, and the Tegan and Sara.The term was coined by Autostraddle.com and has since become a common collloquialism.",
        "example": "1.) Jess just came out and, after going to her first Tegan and Sara concert, got an alternative lifestyle haircut similar to Tegan's.2.) Once Leah added an alternative lifestyle haircut to her outfit composed of American Apparel and a skinny tie, she became infinitely more attractive."
    },
    {
        "word": "Hush Trip",
        "mean": "RVshare's 2023 Travel Trend Report defines a \"Hush Trip\" as a remote employee who works full-time from an alternative location where they plan to enjoy leisure activities in their off-hours, and don't feel the need to disclose their location. 56% of all remote employees are say that they're very or extremely likely to partake in a \"Hush Trip\" this year.",
        "example": "\"I am taking a \"Hush Trip\" this year and working while on-the-road\""
    },
    {
        "word": "barnacle",
        "mean": "1. A small marine organism with a shell that clings to rocks and ships.\n2. A clinging or dependent person or thing\n3. A large zit or scab\n4. An exclimation used by Sponge Bob Square Pants meaning \"shit\" or \"fuck\"",
        "example": "1. Based on the number of barnacles stuck to this sunken ship, I deduce that it must have been here for a while.\n2. God, I hate Henry! The little barnacle won't leave me alone!\n3. Did you see the barnacle on Lisa's face?! It was huge!\n4. Patrick: \"I'm not actually gay, Sponge Bob.\"\n   Sponge Bob: \"Oh barnacles!!\""
    },
    {
        "word": "Gentleman's B",
        "mean": "When you have a good enough grade in your class and you are so bogged down by other work at the end of the semester that you email your professor and tell him you're not gonna take the exam and will take a \"B\" in his class",
        "example": "Student in email: \"Dear Professor, my finals period is packed and its just not worth it for me to not sleep for the next three days to get a good grade on the test since I have a really good grade in the class already. Can I just take the Gentleman's B?\nTeacher: Sure."
    },
    {
        "word": "sky daddy",
        "mean": "euphemism for god",
        "example": "go cry to your sky daddy"
    },
    {
        "word": "nicheposting",
        "mean": "The act of posting content targeted at a niche audience.",
        "example": "\"I love nicheposting obscure European history memes.\""
    },
    {
        "word": "artwash",
        "mean": "Buying art for museums or galleries in order to improve public opinion of you, your family, or your company.",
        "example": "The sackler family couldn't even artwash away their part in the north american opioid crisis."
    },
    {
        "word": "Quest Sex",
        "mean": "The kinda sex you get after killing a dragon (defeating an ememy, obstical, or rival in a professional workplace or situation) saving a village from an army of attacking monsters (providing a stable household for your woman and offspring in the face of lifes moral dillemmas) or any other large and notable achievement.",
        "example": "I havent gotten quest sex since my honeymoon, maybe its time to hit the grinding stone."
    },
    {
        "word": "yap city",
        "mean": "Yap city: when someone is just chatting on and on about nothing.",
        "example": "Girl: he is just not that cute and he thinks he ate me up when we were arguing.Boy: bro she’s yap city rn"
    },
    {
        "word": "prebunk",
        "mean": "Verb - to debunk lies you know are coming in advance.",
        "example": "The fact checkers were able to prebunk most of the lies they knew Trump would tell before the speech even started."
    },
    {
        "word": "Taint Tanning",
        "mean": "Taint Tanning - the act of going full ass up, crotch open during a tanning session in order to get color/tan on that elusive 1\" patch of real estate, and eliminate \"butt smile lines\". The exact opposite of anal bleaching. Butthole shade matching the surrounding skin tone.Taint - The perineum is the space between the anus and scrotum in the male and between the anus and the vulva in the female. The perineum is the region of the body between the pubic symphysis (pubic arch) and the coccyx (tail bone), including the perineal body and surrounding structures.Tanning - is the process whereby skin color is darkened or tanned. It is most often a result of exposure to ultraviolet (UV) radiation from sunlight or from artificial sources, such as a tanning lamp found in indoor tanning beds. People who deliberately tan their skin by exposure to the sun engage in a passive recreational activity of sun bathing. Some people use chemical products which can produce a tanning effect without exposure to ultraviolet radiation, known as sunless tanning.Post THAT shit !!!!",
        "example": "Great day in the day in the back yard, even got some taint tanning in.huh, WTF?\nDude got rays on the button knot. It's healthy n shit.God damn dude, make sure you got Aloe suppositories, ..lol"
    },
    {
        "word": "Gob",
        "mean": "\"Gob\" is a quaint English term of endearment that is often used to express one's deep affection and commitment to their significant other. This term is typically used when one wants to express their desire to nourish and sustain their partner for a lifetime. The term \"gob\" is derived from the Old English word \"gobba,\" which means \"mouthful,\" and is often associated with the act of feeding someone.When someone says \"my gob,\" they are essentially saying that they want to provide for their loved one and take care of their every need, particularly when it comes to food. It's a term that is deeply rooted in the idea of nurturing and caring for one another, and it's often used to express the depth of one's love and devotion.So if you ever hear someone refer to their partner as \"my gob,\" you can be sure that they are expressing their desire to care for and provide for their loved one for the rest of their days. It's a sweet and sentimental term that truly embodies the meaning of true love and commitment.",
        "example": "person: you're my gob\nperson 2: hehe"
    },
    {
        "word": "Mockstalgia",
        "mean": "Any revisit of a thing, be it music, art or otherwise, that tries to evoke nostalgia but rings hollow like it's also mocking said thing. A thinly veiled inside joke",
        "example": "Bands like Wet Leg callback like 90's cool but are really mockstalgia because they don't believe it... they're goofing on it"
    },
    {
        "word": "Trash Owl",
        "mean": "Someone who constantly ruins their sleep schedule, through no real fault of their own.",
        "example": "I swear I become such a trash owl when I go to UNI!!"
    },
    {
        "word": "scuppie",
        "mean": "A yuppie with a social conscience.  Someone 'green' who loves the earth as much as money.",
        "example": "Scuppies like to make green as much as they want to protect green..."
    },
    {
        "word": "mzungu",
        "mean": "In Swahili (the lingua franca of East Africa): someone who wanders without purpose / someone constantly on the move.\nIt came to be applied to all white people in East Africa, as most were encountered as traders, visiting colonial officials or tourists.\nToday, white tourists are often greeted (especially by children) with the cry: \"Bye bye mzungu!\"\nFor some reason, they rarely say \"Hello mzungu!\" when they see one coming...",
        "example": "Child: \"Bye bye mzungu!\"\nIndignant white person: \"Listen, it's 'hello mzungu!' - and anyway, I've lived here for 25 years, you cheeky devil.\"\nChild: (pause) \"Bye bye mzungu!\"\nor\nUgandan Stall-holder: \"A bowl of passion fruit? Um... that'll be 3,000 shillings please.\"\nIndignant white person: \"Come again? I'm not paying mzungu prices, I've lived here 25 years!\" etc. etc."
    },
    {
        "word": "Chocolate Abs",
        "mean": "An Asian male who has defined, muscular abdominal muscles that look like the subdivided parts of a chocolate bar.",
        "example": "The guys in the Korean pop group Big Bang have sexy chocolate abs."
    },
    {
        "word": "slerp",
        "mean": "to drool in your sleep; to generate exceptionally long drops of spit connecting the corner of your mouth with the puddle around your pillow",
        "example": "Look, he's slerping again!"
    },
    {
        "word": "Ego Birth",
        "mean": "The opposite of Ego Death. An Ego Birth is when a person, usually a (cis caucasian male) takes psychedelics, then proceeds to become more of an insufferable person than they were before. They often brag about discovering basic human empathy and understanding in their late twenties.",
        "example": "That guy definitely had a ego birth, he took acid once now constantly gloats about gaining basic human emotions."
    },
    {
        "word": "Zion Curtain",
        "mean": "In Utah, a partition that separates the patrons of a bar from the bartender and prevents drinks from being passed directly from the place where they are mixed to the customer.\nThe name comes from \"Zion,\" a reference to the LDS (Mormon ) Church whose prohibitions against drinking alcohol heavily influenced Utah's liquor laws.",
        "example": "Because the bar that she tended at had a Zion Curtain, Sarah had to walk around to the other side to hand every customer their drink. It was a pain in the ass, but at least it was good exercise."
    },
    {
        "word": "Bibliosuperior",
        "mean": "A feeling of superiority to another person because one reads books, especially physical copies.",
        "example": "The librarian was bibliosuperior to her brother who watches wrestling."
    },
    {
        "word": "Hydro Homies",
        "mean": "Homies who stay hydrated",
        "example": "\"Coke or Pepsi?\"Water please, were Hydro Homies"
    },
    {
        "word": "Boyfriend Island",
        "mean": "Describes a period of time when a friend is un-contactable due to being loved up with/holed up with/obsessed with a new boyfriend. Person becomes as isolated and uncontactable as if they were on a desert island.",
        "example": "'Have you heard from Kayley?'\n'Nope, she's on boyfriend island. She's not calling anyone back. Totally out of the loop'."
    },
    {
        "word": "dark ambient",
        "mean": "Dark ambient is like a marriage between ambient and industrial. Is naturally dark and much more interesting than regular ambient. Doesn't feature any cheesy synths, unless made by an ex black metal musician (that oftenly makes people bitch about whether the music is dark ambient or not; it usually is not). Usually doesn't feature any guitars. On those rare cases when it does (like in drone doom), it's definitely non-conventional use.\nMuch influenced by \"musique concrete\", dark ambient features recorded sounds, oftenly of non-musical nature.\nDark ambient can have various esthetics. Moaning and chanting, chain rattling (no, that's no ghost) raison d'etre-like stuff, radioactive droning of Fallout soundtrack, heavy pounding sounds of mechanisms, crazy shamanic drum-machine sounds, abrasive noise fragments - all these can make up different moods in dark ambient.\nPeople who don't get dark ambient music, are found scrolling through the tracks in their desperate attempt of finding \"where does at least SOME music start?\"There's also a tendency among some cultist freaks to puke up some really lousy synth pads and moans, put runes or pentagrams and some pseudo-religious texts on an album cover and call it \"dark ambient\", or \"pagan/ritual/black dark ambient\", or \"neo-satanic nazi anti-nazi superficial industrial death dark ambient\". Trust me, you don't wanna listen to that crap.",
        "example": "Don't get scared away by Deutsch Nepal's track names. That guy is a sick bastard, but he still makes some good dark ambient."
    },
    {
        "word": "Velcro Kitty",
        "mean": "A annoying neurotic housepet that craves affection like a addict craves drugs. If you start petting it, it will expect you to keep stroking it and rubbing it under the chin indefinitely. You push it off you 98 times, it crawls back on you 99 times, purring, rubbing, kneading, licking, drooling, and looking cute. A black bottomless hole of need. It sticks to you and can only be removed with force, a condition known as Cattic Cling. These episodes frequently occur when unsuspecting human target is playing a computer game or reading a book or trying to write. Putting on formal or expensive clothing that shows every single cat hair can also trigger velcro kitty behavior.",
        "example": "My cat has gone all velcro kitty on me and won't leave me alone."
    },
    {
        "word": "Aegyo",
        "mean": "A korean word that derives from the Chinese characters \"love (ae)\" and \"beautiful (gyo).\" The closest English translation of aegyo would be \"winsome,\" defined by the Merriam Webster Dictionary as \"generally pleasing and engaging often because of a childlike charm and innocence.\" Not surprisingly, aegyo is considered a feminine trait, generally attributed to women who can charm men and elders through a careful balance of sweetness, cuteness, poutiness, modesty, thoughtfulness, and submissiveness. A woman with aegyo knows to blush at dirty jokes rather than guffaw along with her mouth agape. A woman with aegyo knows to let out a modest and appealing squeal and grab tight her date's hand when watching a horror movie.",
        "example": "Some people just hate her aegyo.Jessica had a great aegyo!"
    },
    {
        "word": "donorcycle",
        "mean": "a motorcycle, when driven poorly",
        "example": "\"Call the Trauma Team! Incoming from donorcycle\""
    },
    {
        "word": "Green bubble struggle",
        "mean": "When you are in a groupchat and/or texting someone with an android and the text bubble turns green unstead of the blue that it would be with just apple users (it limits you from doing things such as removing people from the group chat)",
        "example": "Yo bruh who is causeing the green bubble struggle?Bruh i think its Ryan"
    },
    {
        "word": "bbq chicken",
        "mean": "noun - in basketball, a phrase used to describe a big man whose toughness is considerably less than his size would imply.  a big man who does little to deter dunks or shots near the basket.",
        "example": "Pass me the rock; I got bbq chicken guarding me.\n\nTake it to the hole!  Bbq chicken can't stop you!\n\nI looked in the paint and saw bbq chicken standing there, so I put the ball on the floor and went to the hoop.\n\n"
    },
    {
        "word": "buckle bunny",
        "mean": "Female groupie of rodeo cowboys",
        "example": "His trailer was filled with buckle bunnies after the show"
    },
    {
        "word": "gadgetbahn",
        "mean": "Any mode of transport that is \"futuristic\" or \"innovative\" in theory, but ends up being either infeasible, impractical, or just a steaming pile of shit in practice.\nGadgetbahn systems are often outperformed by the most basic things, such as buses.",
        "example": "The Simpsons monorail is a classic example of gadgetbahn in television\nElon Musk's \"3D roads\" have been condemned by many as being an overly expensive gadgetbahn"
    },
    {
        "word": "Battinson",
        "mean": "Portmanteau of robert pattinson and BatmanA fairly good batman, (portrayed by robert pattinson duh!)\nwho’s not to be judged from twilightBattinson is somewhat comic accurate, a bit skinny but still muscular, he’s no batfleck but he’s greatYounger batman so he gets a free pass, pretty cool padded suit (likely to compensate for no muscles lol) and has a great solo movie, far from perfect but THE BATMAN 2022 IS AWESOME!Battinson is the newest Batman, hoping he sticks around unlike batfleck (whom I hope returns)",
        "example": "Battinson is the best emo batman onscreen!The batman is pretty much se7en with batman but that’s alright, let battinson shine!Battinson gots a pretty sick batsuitThug: what the hell are you supposed to be?Battinson: *pounds thugs into the ground*…Battinson: I’m vengeance"
    },
    {
        "word": "pixel peeper",
        "mean": "1) A digital photographer who magnifies photographs on the computer screen to critically evaluate image resolution at the pixel level.  Commonly used as a derogatory remark to describe:\na) A photography n00b who erroneously believes that the quality of a digital camera is determined solely by the number of megapixels.\nb) Insecure troll who frequents digital camera forums to religiously proclaim how his/her camera pixel count is greater than yours.\nc) Wanna be photographer who debates about pixel count all day but doesn't have the talent to take a half-decent photograph.",
        "example": "I grow tired following the thread of verbal diarrhea left behind by that pixel peeper.\n\nWhy don't you pixel peepin' trolls get some sunshine this week and take a photograph or two?\n"
    },
    {
        "word": "bean dip",
        "mean": "Raise the underboob of a man or woman with your index and second finger.",
        "example": "Cameron gave Lori a \"bean dip\" to celebrate the fun evening"
    },
    {
        "word": "yips",
        "mean": "The \"yips\" is a set of conditions associated with having your nerves badly rattled. Can affect the performance of athletes and in the case of combat veterans is a symptom of PTSD(Post Traumatic Stress Disorder).",
        "example": "1) I got the yips and bogeyed the rest of the holes.2) My post military career prospects aren't looking so good with a bad case of the combat yips and and drinking myself to sleep every night."
    },
    {
        "word": "Seppo",
        "mean": "Derogertory word used by the English and Australians for all American nationals. Derived from Rhyming slang (Septic Tank = Yank)",
        "example": "Will those stupid seppos ever shut up bragging about how much lemonade they can drink?"
    },
    {
        "word": "poverty tour",
        "mean": "Poverty tourism, also known as slum or ghetto tourism, is a type of urban travel undertaken by individuals from developed nations to observe poverty-stricken areas, mostly in underdeveloped or developing nations. This type of travel generally consists of guided tours around urban impoverished areas",
        "example": "Those wanna-be InstaBitches went to Detroit on a poverty tour to see how the \"poor\" live."
    },
    {
        "word": "Quill Pig",
        "mean": "Another name for porcupine.",
        "example": "The quill pig ate my brake lines and left quills in my dog."
    },
    {
        "word": "armchair tourist",
        "mean": "Someone who goes on holiday with just google street view",
        "example": "Oh, I've never actually been to New York, I'm just an armchair tourist"
    },
    {
        "word": "Scurryfunge",
        "mean": "A hasty tidying of the house between the time you see a neighbor and the time he/she knocks on the door.-John Gould's Maine Lingo: Boiled Owls, Billdads, and Wazzats, 1975",
        "example": "My hectic scurryfunge was the result of a missed call from Bob saying he'd come over."
    },
    {
        "word": "Gravy SEAL",
        "mean": "A gravy SEAL is a person either belonging to a militia group or has an unhealthy obsession with the military, guns, and anti-government views, but was never actually in the military due to either being grossly out of shape, mentally unfit, or just too dumb to function. Years of dead end jobs and poor diet have made white, middle aged men very upset. Some express that anger through squeezing into a paintball vest that sits just above their beer gut, and sit in the woods to shoot beer cans and talk about how they'll protect THE GREAT US of A from the evil hippies that love ISIS, hate Jesus, and probably have satanic rituals to sacrifice kids they keep held in a DC pizza shop.Although a term of mockery, Gravy SEALs should be taken seriously, as they are deluded AND have access to copious amounts of arms, and plenty of just as delusional friends to back them up. They may be fat, unhealthy, conspiracy nuts, but they have real guns.Tl;dr - military wannabe LARPers, but with actual guns.",
        "example": "Ex: I was going to eat lunch at Chapman park, but apparently the gravy SEALs have been deployed there for some rally.Ex: Those guys are so spineless. They stamp and holler and threaten to send in their gravy SEALs, but then decide to cancel and whimper about it being unsafe."
    },
    {
        "word": "cowpoke",
        "mean": "1.  (noun)  A lazy cowboy who neglects their duties on a farm or ranch.\n\n2.  (noun)  A rural person in an urban environment, such as an office, who's mannersisms are notably different, less competitive, and often performed at a slower pace than the urbanites.  The term may be used in either an endearing or insulting way.\n\n3.  (verb)  The act of pressing one's finger against a domesticated bovine for the purpose of testing the quality of meat or just for fun.  Usually the index finger is used.\n\n4.  (noun)(slang)  A male person with a tendency to have sex with only overweight females.",
        "example": "1.  \"Umm...Ma?  I saw the cowpoke fishing at the river with no pants on I think.\"\n\n2.  BOSS:  Hey, cowpoke.  I need 25 copies of this report.\nCOWPOKE:  You're funny, Mister Wilson.  I like you.\nBOSS:  Actually, I'm serious.  I need them before the staff meeting.\nCOWPOKE:  Well.  I'll see what I can do.  Heh heh heh.\n\n3.  Leanne secretly watched Andy as his cowpokes seemed like more than just cowpokes lately.\n\n4.  After picking him up from his mom's motel room that morning, Bennie surprised Jay by calling him a cowpoke."
    },
    {
        "word": "Full send",
        "mean": "V. 100% commitment to doing some heinous shit. Commonly used among skiiers/snowboarders.",
        "example": "I'm about to hit this cliff full send bro. Is the camera rolling?"
    },
    {
        "word": "DIwhy",
        "mean": "When someone makes a really horrible DIY and shares it on the internet.",
        "example": "A Person in The Internet: Look at this beautiful toilet paper with brown clay on it! Now you can paint brown anywhere in the house!\nYou: DIwhy"
    },
    {
        "word": "swaffling",
        "mean": "The act of slapping something with a semi-erect penis. It's derived from the Dutch verb \"swaffelen\".In 2008 it won the title \"Dutch word of the year\" in a yearly held competion where the Dutch speaking public can vote online which new word, that originated in that year, they liked the most.\nIt had gotten a lot of media attention because a Dutch student \"swaffled\" the Taj Mahal on a school trip; and got expelled from his school for that action.Recently Brittish carshow host Jeremy Clarkson mentioned it in a talkshow (BBC Qi), where he gave the definition: \"To bang your penis against the Taj Mahal\".He also mentioned the word on the fifth episode of the new carshow \"The Grand Tour\" which was hosted from a tent in Rotterdam (the Netherlands).",
        "example": "The Dutch boy that boasted about swaffling the Taj Mahal on his school trip got expelled from his school."
    }
]